# *********************************************************************************************************
# Сформировать из введенного числа обратное по порядку входящих в него цифр и вывести на экран.
# Например, если введено число 3486, то надо вывести число 6843.
# **********************************************************************************************************

number = input('Введите целое положительное число: ')

new_number = ' '

for digit in number:
    new_number = digit + new_number

print(int(new_number))
