# *********************************************************************************************************
# Посчитать, сколько раз встречается определенная цифра в введенной последовательности чисел.
# Количество вводимых чисел и цифра, которую необходимо посчитать, задаются вводом с клавиатуры.
# **********************************************************************************************************

def count_digit(amount_numbers, x, count_x=0):
    if amount_numbers == 0:
        return count_x
    else:
        number = input('Введите число: ')
        for digit in number:
            if digit == str(x):
                count_x += 1
        return count_digit(amount_numbers - 1, x, count_x)


print(count_digit(int(input('Введите количество вводимых чисел: ')),
                  input('Введите цифру, которую необходимо посчитать: ')))
