# ************************************************************************************************
# Вводятся три разных числа. Найти, какое из них является средним (больше одного, но меньше другого).
# ************************************************************************************************

# https://drive.google.com/file/d/1IKILQ4Tfy6gtK-dDEkCi--CaubFAOWYU/view?usp=sharing

print('Введите три разных числа')
a = float(input('Введите первое число: '))
b = float(input('Введите второе число: '))
c = float(input('Введите третье число: '))

if a > b:
    if a < c:
        print(a)
    elif c > b:
        print(c)
    else:
        print(b)
elif a > c:
    print(a)
elif c > b:
    print(b)
else:
    print(c)
