# *********************************************************************************************************
# Во втором массиве сохранить индексы четных элементов первого массива.
# Например, если дан массив со значениями 8, 3, 15, 6, 4, 2,
# то во второй массив надо заполнить значениями 1, 4, 5, 6 (или 0, 3, 4, 5 - если индексация начинается с нуля),
# т.к. именно в этих позициях первого массива стоят четные числа.
# **********************************************************************************************************

import random

SIZE = 10
MIN_ITEM = -700
MAX_ITEM = 100000
array = [random.randint(MIN_ITEM, MAX_ITEM) for _ in range(SIZE)]
result = []
j = -1

for i in array:
    j += 1
    if i % 2 == 0:
        result.append(j)

print(array)
print(result)
