# *********************************************************************************************************
# Написать программу сложения и умножения двух шестнадцатеричных чисел.
# При этом каждое число представляется как коллекция, элементы которой — цифры числа.
# Например, пользователь ввёл A2 и C4F. Нужно сохранить их как [‘A’, ‘2’] и [‘C’, ‘4’, ‘F’] соответственно.
# Сумма чисел из примера: [‘C’, ‘F’, ‘1’], произведение - [‘7’, ‘C’, ‘9’, ‘F’, ‘E’].
# **********************************************************************************************************

from collections import deque

digits = {'0': 0, '1': 1, '2': 2, '3': 3, '4': 4, '5': 5, '6': 6, '7': 7, '8': 8, '9': 9, 'A': 10, 'B': 11, 'C': 12,
          'D': 13, 'E': 14, 'F': 15}
x = list(input('Введите первое число: '))
y = list(input('Введите второе число: '))
s = 0
result = deque([])
i = len(x)
j = len(y)

for k in range(max(i, j)):
    if i == 0:
        x1 = 0
    else:
        i -= 1
        x1 = digits[x[i]]
    if j == 0:
        y1 = 0
    else:
        j -= 1
        y1 = digits[y[j]]
    z = x1 + y1 + s
    if z - 16 > 0:
        s = 1
        result.appendleft(''.join(digit for digit, value in digits.items() if value == z - 16))
    else:
        s = 0
        result.appendleft(''.join(digit for digit, value in digits.items() if value == z))
if s == 1:
    result.appendleft('1')

print(list(result))
